Revit 2024 API
BuiltInFailures.SketchFailures.InvalidSketchForFloor Property
 Floor sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidSketchForFloor { get; }
Visual Basic
Public Shared ReadOnly Property InvalidSketchForFloor As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidSketchForFloor {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace